
# Pandas Series and DataFrame
*****************************
Using Pandas Library to play with Series and DataFrame.

### 1. Series Data Structure (1D)

Create a series data structure called s1 with the following values [10,20,30,40,50,60] and then print it.

In [1]:
import pandas as pd
s1 = pd.Series([10,20,30,40,50,60])
print(s1)

0    10
1    20
2    30
3    40
4    50
5    60
dtype: int64

Print the left column which is the index.

In [2]:
print(s1.index)

RangeIndex(start=0, stop=6, step=1)

Print the type of the second column which is the actual data.

In [3]:
s1.dtypes

dtype('int64')

Print the values in index location 3.

In [4]:
s1[2]

30

Create a series data structure called s2 with the following values [10,20,30,40,50,60] and with index ['a', 'b', 'c', 'd', 'e', 'f'] then print it.

In [5]:
s2 = pd.Series([10,20,30,40,50,60],index=['a','b','c','d','e','f'])
s2

a    10
b    20
c    30
d    40
e    50
f    60
dtype: int64

Print the value in row with the index label 'e'.

In [6]:
s2['e']

50

Change the value of row with the index label 'e' into 51.

In [7]:
s2['e']=51
s2

a    10
b    20
c    30
d    40
e    51
f    60
dtype: int64

Print all rows between labels 'b' and 'e' using the slice notation.

In [8]:
s2['b':'e']

b    20
c    30
d    40
e    51
dtype: int64

Print all rows between labels 'b' until the end using the slice notation.

In [9]:
s2['b':]

b    20
c    30
d    40
e    51
f    60
dtype: int64

Add the number 3 to all rows in s2 without using a for-loop.

In [10]:
# s2[:]=3
# s2

Check if the value 54 is in s2 without using a for-loop.

In [11]:
print(54 in s2)

False

Check which values in s2 are greater than 30.

In [12]:
s2[s2>30]

d    40
e    51
f    60
dtype: int64

Print the values in s2 that are greater than 30.

In [13]:
s2[s2>30]

d    40
e    51
f    60
dtype: int64

print all values in s2 that are greater than the mean value.

In [14]:
s2[s2>s2.mean()]

d    40
e    51
f    60
dtype: int64

### 2. DataFrame Data Structure (2D)

Create a dictionary called dic1 with the following data: {'Name':[ 'David', 'John', 'Marta', 'Dianna'], 'Age':[41,19,33,24],'Weight':[85,76,67,56]} and then create create a dataframe called df from dic1. Print df dataframe.

In [15]:
dic1 = {'Name':[ 'David', 'John', 'Marta', 'Dianna'], 'Age':[41,19,33,24],'Weight':[85,76,67,56]} 
df = pd.DataFrame(dic1)
df

     Name  Age  Weight
0   David   41      85
1    John   19      76
2   Marta   33      67
3  Dianna   24      56

Print the rows index attribute of df dataframe.

In [16]:
df.index

RangeIndex(start=0, stop=4, step=1)

Print the columns attribute of df dataframe.

In [17]:
df.columns

Index(['Name', 'Age', 'Weight'], dtype='object')

Print the values attribute of df dataframe.

In [18]:
df.values

array([['David', 41, 85],
       ['John', 19, 76],
       ['Marta', 33, 67],
       ['Dianna', 24, 56]], dtype=object)

Bonus step - can you change the rows index attribute to the following labels: 'R1', 'R2', 'R3', 'R4' and print the df dataframe? (tip - create a list with those new labels and then copy the list into the relevant dataframe attribute).

In [19]:
df.index = ['R1','R2','R3','R4']
df

      Name  Age  Weight
R1   David   41      85
R2    John   19      76
R3   Marta   33      67
R4  Dianna   24      56

### 3. Data Selection in a DataFrame

Create a dictionary called dic1 with the following data: {'Name':[ 'David', 'John', 'Marta', 'Dianna'], 'Age':[41,19,33,24],'Weight':[85,76,67,56]} and then create create a dataframe called df from dic1 with the following rows index ['a','b','c','d']. Print the dataframe.

In [20]:
dic1 = {'Name':[ 'David', 'John', 'Marta', 'Dianna'], 'Age':[41,19,33,24],'Weight':[85,76,67,56]} 
df = pd.DataFrame(dic1,index=['a','b','c','d'])
df

     Name  Age  Weight
a   David   41      85
b    John   19      76
c   Marta   33      67
d  Dianna   24      56

Print the 'Name' column using the dot notation.

In [21]:
df.Name

a     David
b      John
c     Marta
d    Dianna
Name: Name, dtype: object

Print the 'Name' and 'Age' columns using square brackets.

In [22]:
df[['Name','Age']]

     Name  Age
a   David   41
b    John   19
c   Marta   33
d  Dianna   24

Print the type of object returned by selecting the 'Name' column using square brackets.

In [23]:
df['Name'].dtypes

dtype('O')

Print the type of object returned by selecting the 'Name' and 'Age' columns using square brackets.

In [24]:
df[['Name','Age']].dtypes

Name    object
Age      int64
dtype: object

Print the rows starting in index location 0 and ending in index location 2.

In [25]:
df[0:3]

    Name  Age  Weight
a  David   41      85
b   John   19      76
c  Marta   33      67

Print all rows with columns 'Name' and 'Age' while using the loc method.

In [26]:
df.loc[:,('Name','Age')]

     Name  Age
a   David   41
b    John   19
c   Marta   33
d  Dianna   24

Print rows  with labels 'a' and 'd' with columns 'Name' and 'Age' while using the loc method.

In [27]:
df.loc[('a','d'),:]

     Name  Age  Weight
a   David   41      85
d  Dianna   24      56

Print the row in index location 2 using the iloc method.

In [28]:
df.iloc[2,:]

Name      Marta
Age          33
Weight       67
Name: c, dtype: object

Print the rows in index location 1,2 and 3 using the iloc method.

In [29]:
df.iloc[1:4,:]

     Name  Age  Weight
b    John   19      76
c   Marta   33      67
d  Dianna   24      56

Print the rows in index location 1,2 and 3 and columns in index locations 0 to 1 using the iloc method.

In [30]:
df.iloc[1:4,0:2]

     Name  Age
b    John   19
c   Marta   33
d  Dianna   24

### End of document
************************